# Customers and Products Analysis Using SQL


## Introduction

The goal of this project is to analyse data from a sales records database for scale model cars
and extract information for decision-making. The scale model cars database contains eight tables:

- **customers:** customer data
- **employees:** all employee information
- **offices:** sales office information
- **orders:** customers' sales orders
- **orderdetails:** sales order line for each sales order
- **payments:** customers' payment records
- **products:** a list of scale model cars
- **productlines:** a list of product line categories

Good analysis starts with questions. Below are the questions we want to answer for this project.

- *Question 1*: Which products should we order more of or less of?
- *Question 2*: How should we tailor marketing and communication strategies to customer behaviours?
- *Question 3*: How much can we spend on acquiring new customers?

## Scale Model Cars Database

First of all, we'll connect our Jupyter Notebook to our database file using the following code.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///stores.db

Next, let's explore the database by writing a query to display the table names, the number of columns
and the number of rows in each of them.

In [2]:
%%sql

SELECT 'Customers' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('customers')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM customers

 UNION ALL

SELECT 'Products' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('products')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM products
  
 UNION ALL

SELECT 'ProductLines' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('productlines')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM productlines

 UNION ALL

SELECT 'Orders' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('orders')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM orders

 UNION ALL

SELECT 'OrderDetails' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('orderdetails')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM orderdetails

 UNION ALL

SELECT 'Payments' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('payments')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM payments

 UNION ALL

SELECT 'Employees' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('employees')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM employees

 UNION ALL

SELECT 'Offices' AS table_name,
       (SELECT COUNT(*)
          FROM pragma_table_info('offices')) AS number_of_columns,
       COUNT(*) AS number_of_rows
  FROM offices;

 * sqlite:///stores.db
Done.

[('Customers', 13, 122),
 ('Products', 9, 110),
 ('ProductLines', 4, 7),
 ('Orders', 7, 326),
 ('OrderDetails', 5, 2996),
 ('Payments', 4, 273),
 ('Employees', 8, 23),
 ('Offices', 9, 7)]

## Question 1: Which Products Should We Order More of or Less of?
  
Now that we know the database a little better, we can answer the first question: *Which products should we order more of or less of?* 

This question refers to inventory reports, including low stock and product performance. This will optimise the supply and the user experience by preventing the best-selling products from going out-of-stock.

- The **low stock** represents the quantity of `each product sold divided by the quantity of product in stock`. We'll consider the ten highest rates. These will be the top ten products that are (almost) out-of-stock.
- The **product performance** represents the `sum of sales per product`.
- **Priority products for restocking** are those with `high product performance` that are on the brink of being `out of stock`.

In [3]:
%%sql

SELECT p.productCode, p.productName, p.productLine,
       ROUND(SUM(od.quantityOrdered * 1.0) / p.quantityInStock, 2) AS low_stock,
       ROUND(SUM(od.quantityOrdered * od.priceEach), 2) AS product_performance
  FROM orderdetails AS od
  JOIN products AS p
    ON od.productCode = p.productCode
 GROUP BY p.productCode
 ORDER BY product_performance DESC, low_stock DESC
 LIMIT 10;

 * sqlite:///stores.db
Done.

[('S18_3232', '1992 Ferrari 360 Spider red', 'Classic Cars', 0.22, 276839.98),
 ('S12_1108', '2001 Ferrari Enzo', 'Classic Cars', 0.28, 190755.86),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Cars', 0.13, 190017.96),
 ('S10_4698', '2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', 0.18, 170686.0),
 ('S12_1099', '1968 Ford Mustang', 'Classic Cars', 13.72, 161531.48),
 ('S12_3891', '1969 Ford Falcon', 'Classic Cars', 0.92, 152543.02),
 ('S18_1662', '1980s Black Hawk Helicopter', 'Planes', 0.2, 144959.91),
 ('S18_2238', '1998 Chrysler Plymouth Prowler', 'Classic Cars', 0.21, 142530.63),
 ('S18_1749', '1917 Grand Touring Sedan', 'Vintage Cars', 0.34, 140535.6),
 ('S12_2823', '2002 Suzuki XREO', 'Motorcycles', 0.1, 135767.03)]

Classic cars are the priority for restocking. They sell frequently, and they are the highest-performance products.
 
## Question 2: How Should We Match Marketing and Communication Strategies to Customer Behaviours?

In the first part of this project, we explored products. Now we'll explore customer information by answering the second question: *How should we match marketing and communication strategies to customer behaviours?*

This involves categorising customers: finding the VIP (very important person) customers and those who are less engaged.
- VIP customers bring in the most profit for the store.
- Less-engaged customers bring in less profit.

Before we begin, let's compute how much profit each customer generates.

In [4]:
%%sql

SELECT o.customerNumber,
       ROUND(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)), 2) AS profit
  FROM products AS p
  JOIN orderdetails AS od
    ON p.productCode = od.productCode
  JOIN orders AS o
    ON od.orderNumber = o.orderNumber
 GROUP BY o.customerNumber;

 * sqlite:///stores.db
Done.

[(103, 10063.8),
 (112, 31312.72),
 (114, 70311.07),
 (119, 60875.3),
 (121, 41391.52),
 (124, 236769.39),
 (128, 27728.34),
 (129, 28092.43),
 (131, 58669.1),
 (141, 326519.66),
 (144, 25138.38),
 (145, 50973.68),
 (146, 53211.19),
 (148, 60477.38),
 (151, 72370.09),
 (157, 40429.55),
 (161, 41510.76),
 (166, 41305.17),
 (167, 40592.06),
 (171, 27143.39),
 (172, 34650.17),
 (173, 13734.7),
 (175, 41313.51),
 (177, 24360.18),
 (181, 28279.5),
 (186, 38808.53),
 (187, 60095.86),
 (189, 19588.29),
 (198, 6586.02),
 (201, 43523.64),
 (202, 28882.99),
 (204, 24296.9),
 (205, 40397.88),
 (209, 31526.6),
 (211, 16868.68),
 (216, 24113.54),
 (219, 2610.87),
 (227, 34655.62),
 (233, 25856.86),
 (239, 31594.7),
 (240, 26808.79),
 (242, 23905.16),
 (249, 34100.63),
 (250, 28390.81),
 (256, 24610.8),
 (259, 36744.01),
 (260, 24118.93),
 (276, 54551.66),
 (278, 52309.63),
 (282, 52331.45),
 (286, 36337.69),
 (298, 43393.75),
 (299, 25665.76),
 (311, 38334.95),
 (314, 25861.96),
 (319, 31815.01),
 (320, 39136.14),
 (321, 55674.28),
 (323, 60013.99),
 (324, 31667.93),
 (328, 32240.57),
 (333, 22579.18),
 (334, 40095.85),
 (339, 20737.79),
 (344, 18953.3),
 (347, 14928.37),
 (350, 27184.74),
 (353, 52698.66),
 (357, 39321.91),
 (362, 32549.53),
 (363, 45090.39),
 (379, 28969.09),
 (381, 11693.99),
 (382, 54724.68),
 (385, 35987.68),
 (386, 48516.67),
 (398, 43487.88),
 (406, 38755.5),
 (412, 38399.18),
 (415, 13033.35),
 (424, 26001.55),
 (447, 18957.41),
 (448, 46777.54),
 (450, 55931.37),
 (452, 18358.11),
 (455, 29265.9),
 (456, 13066.02),
 (458, 49192.39),
 (462, 36886.05),
 (471, 22433.82),
 (473, 9532.93),
 (475, 17186.93),
 (484, 21225.65),
 (486, 33598.57),
 (487, 17230.12),
 (489, 10868.04),
 (495, 25244.69),
 (496, 51771.5)]

## Finding the VIP and Less Engaged Customers

In [5]:
%%sql

-- Top 5 VIP customers

WITH

revenue AS (
SELECT o.customerNumber,
       ROUND(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)), 2) AS profit
  FROM products AS p
  JOIN orderdetails AS od
    ON p.productCode = od.productCode
  JOIN orders AS o
    ON od.orderNumber = o.orderNumber
 GROUP BY o.customerNumber
)
 
SELECT c.contactLastName, c.contactFirstName, c.city, c.country,
       r.profit
  FROM customers AS c
  JOIN revenue AS r
    ON c.customerNumber = r.customerNumber
 ORDER BY r.profit DESC
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Freyre', 'Diego ', 'Madrid', 'Spain', 326519.66),
 ('Nelson', 'Susan', 'San Rafael', 'USA', 236769.39),
 ('Young', 'Jeff', 'NYC', 'USA', 72370.09),
 ('Ferguson', 'Peter', 'Melbourne', 'Australia', 70311.07),
 ('Labrune', 'Janine ', 'Nantes', 'France', 60875.3)]

In [6]:
%%sql

-- Top 5 least engaged customers

WITH

revenue AS (
SELECT o.customerNumber,
       ROUND(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)), 2) AS profit
  FROM products AS p
  JOIN orderdetails AS od
    ON p.productCode = od.productCode
  JOIN orders AS o
    ON od.orderNumber = o.orderNumber
 GROUP BY o.customerNumber
)

SELECT c.contactLastName, c.contactFirstName, c.city, c.country,
       r.profit
  FROM customers AS c
  JOIN revenue AS r
    ON c.customerNumber = r.customerNumber
 ORDER BY r.profit ASC
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Young', 'Mary', 'Glendale', 'USA', 2610.87),
 ('Taylor', 'Leslie', 'Brickhaven', 'USA', 6586.02),
 ('Ricotti', 'Franco', 'Milan', 'Italy', 9532.93),
 ('Schmitt', 'Carine ', 'Nantes', 'France', 10063.8),
 ('Smith', 'Thomas ', 'London', 'UK', 10868.04)]

Now that we have the most-important and least-committed customers, we can determine how to drive loyalty and attract more customers.

## Question 3: How Much Can We Spend on Acquiring New Customers?

Before answering this question, let's find the number of new customers arriving each month. That way we can check if it's worth spending money on acquiring new customers. 

This query helps to find these numbers.

In [7]:
%%sql

WITH 

payment_with_year_month_table AS (
SELECT *, 
       CAST(SUBSTR(paymentDate, 1,4) AS INTEGER)*100 + CAST(SUBSTR(paymentDate, 6,7) AS INTEGER) AS year_month
  FROM payments p
),

customers_by_month_table AS (
SELECT p1.year_month, COUNT(*) AS number_of_customers, SUM(p1.amount) AS total
  FROM payment_with_year_month_table p1
 GROUP BY p1.year_month
),

new_customers_by_month_table AS (
SELECT p1.year_month, 
       COUNT(*) AS number_of_new_customers,
       SUM(p1.amount) AS new_customer_total,
       (SELECT number_of_customers
          FROM customers_by_month_table c
        WHERE c.year_month = p1.year_month) AS number_of_customers,
       (SELECT total
          FROM customers_by_month_table c
         WHERE c.year_month = p1.year_month) AS total
  FROM payment_with_year_month_table p1
 WHERE p1.customerNumber NOT IN (SELECT customerNumber
                                   FROM payment_with_year_month_table p2
                                  WHERE p2.year_month < p1.year_month)
 GROUP BY p1.year_month
)

SELECT year_month, 
       ROUND(number_of_new_customers*100/number_of_customers,1) AS number_of_new_customers_props,
       ROUND(new_customer_total*100/total,1) AS new_customers_total_props
  FROM new_customers_by_month_table;

 * sqlite:///stores.db
Done.

[(200301, 100.0, 100.0),
 (200302, 100.0, 100.0),
 (200303, 100.0, 100.0),
 (200304, 100.0, 100.0),
 (200305, 100.0, 100.0),
 (200306, 100.0, 100.0),
 (200307, 75.0, 68.3),
 (200308, 66.0, 54.2),
 (200309, 80.0, 95.9),
 (200310, 69.0, 69.3),
 (200311, 57.0, 53.9),
 (200312, 60.0, 54.9),
 (200401, 33.0, 41.1),
 (200402, 33.0, 26.5),
 (200403, 54.0, 55.0),
 (200404, 40.0, 40.3),
 (200405, 12.0, 17.3),
 (200406, 33.0, 43.9),
 (200407, 10.0, 6.5),
 (200408, 18.0, 26.2),
 (200409, 40.0, 56.4)]

As we can see, the number of clients has been decreasing since 2003, and in 2004, we had the lowest values. The year 2005, which is present in the database as well, isn't present in the table above, this means that the store has not had any new customers since September of 2004. This means it makes sense to spend money acquiring new customers.

To determine how much money we can spend acquiring new customers, we can compute the Customer Lifetime Value (LTV), which represents the average amount of money a customer generates. We can then determine how much we can spend on marketing.

In [8]:
%%sql

-- Customer Lifetime Value (LTV)

WITH

revenue AS (
SELECT o.customerNumber,
       ROUND(SUM(od.quantityOrdered * (od.priceEach - p.buyPrice)), 2) AS profit
  FROM products AS p
  JOIN orderdetails AS od
    ON p.productCode = od.productCode
  JOIN orders AS o
    ON od.orderNumber = o.orderNumber
 GROUP BY o.customerNumber
)

SELECT ROUND(AVG(profit), 2) as LTV
  FROM revenue;

 * sqlite:///stores.db
Done.

[(39039.59,)]

LTV tells us how much profit an average customer generates during their lifetime with our store. We can use it to predict our future profit. So, if we get ten new customers next month, we'll earn 390,395 dollars, and we can decide based on this prediction how much we can spend on acquiring new customers.

## Conclusion

In this project, we found that classic cars sell frequently, and they are the highest-performance products, therefore, they are the priority for restocking. Based on customers spendings, we found the most important and least-committed ones, so we can determine how to drive loyalty and attract more customers. 

As we saw, the number of clients has been decreasing, which means it makes sense to spend money acquiring new customers. We computed the Customer Lifetime Value (LTV), so now we can decide based on this result how much we can spend on acquiring new customers.